[
  {
    "id": "1",
    "title": "Software Engineer III",
    "company": "Google",
    "job_type": "Full-Time",
    "candidate_required_location": "Bengaluru, Karnataka, India",
    "description": "Minimum qualifications:\n- Bachelor’s degree or equivalent practical experience.\n- 2 years of experience with software development in one or more programming languages, or 1 year of experience with an advanced degree.\n- 2 years of experience with data structures or algorithms in either an academic or industry setting.\n\nPreferred qualifications:\n- Master’s degree or PhD in Computer Science or related technical fields.\n- 2 years of experience building and developing infrastructure, distributed systems or networks, or experience with compute technologies, storage, or hardware architecture.\n- Experience developing accessible technologies.\n\nAbout the job:\nGoogle's software engineers develop the next-generation technologies that change how billions of users connect, explore, and interact with information. We're looking for engineers who bring fresh ideas from all areas. You will work on a specific project critical to Google’s needs with opportunities to switch teams and projects. We need our engineers to be versatile, display leadership qualities and be enthusiastic to take on new problems across the full-stack.\n\nResponsibilities:\n- Write product or system development code.\n- Participate in or lead design reviews.\n- Review code and provide feedback.\n- Contribute to documentation or educational content.\n- Triage and resolve system issues.",
    "apply_url": "https://www.google.com/about/careers/applications/jobs/results/110690555461018310-software-engineer-iii-infrastructure-core"
  },
  {
    "id": "2",
    "title": "AI Research Scientist",
    "company": "Microsoft",
    "job_type": "Full-Time",
    "candidate_required_location": "Redmond, WA",
    "description": "Microsoft’s AI team is pushing the boundaries of intelligence, and as an AI Research Scientist, you’ll develop models for Azure Cognitive Services, powering applications like speech recognition and translation. You’ll design algorithms using PyTorch or TensorFlow, publish research, and collaborate with engineers to deploy models at scale. Responsibilities include experimenting with deep learning architectures, optimizing for cloud performance, and presenting findings at conferences like ICML. We seek candidates with a PhD in Computer Science or related fields, 4+ years of AI research experience, and expertise in Python and ML frameworks. Knowledge of cloud platforms like Azure is a plus. Microsoft’s Redmond campus features modern workspaces, free shuttles, and on-site cafes. Our benefits include health coverage, stock awards, and learning stipends for certifications. We support hybrid work (2–3 days in-office) and foster inclusion through groups like Blacks@Microsoft. This role may involve travel (up to 20%) for conferences or team summits. You’ll have access to Microsoft Research’s resources and mentorship for career growth. If you’re excited to advance AI for global users, join us. Microsoft is where innovation meets purpose—apply now to create intelligent solutions that empower businesses and individuals worldwide!",
    "apply_url": "https://careers.microsoft.com/us/en/job/987654321/ai-research-scientist"
  },
  {
    "id": "3",
    "title": "DevOps Engineer, E-Commerce",
    "company": "Amazon",
    "job_type": "Full-Time",
    "candidate_required_location": "Seattle, WA",
    "description": "Amazon’s E-Commerce platform serves millions daily, and as a DevOps Engineer, you’ll automate and scale its infrastructure using AWS. You’ll deploy services with Terraform and Docker, optimize CI/CD pipelines, and ensure 99.99% uptime for storefront features. Responsibilities include monitoring systems with CloudWatch, scripting in Python or Bash, and collaborating with developers to improve deployment cycles. You’ll handle incident responses and drive automation to reduce toil. We seek candidates with a BS/MS in Computer Science, 3+ years of DevOps experience, and expertise in AWS, Terraform, and Kubernetes. Familiarity with microservices is a plus. Amazon’s Seattle office offers dog-friendly spaces, free snacks, and bike storage. Our benefits include health plans, stock units, and relocation support, plus programs like Amazon Future Engineer. We follow Leadership Principles like “Dive Deep” and support inclusion through affinity groups. This role involves hybrid work (3 days in-office) and on-call rotations (compensated). You’ll have access to AWS certifications and career paths. If you’re passionate about reliable systems, join us. Amazon is where builders thrive—apply now to power the world’s largest e-commerce platform and deliver for customers globally!",
    "apply_url": "https://www.amazon.jobs/en/jobs/1122334455/devops-engineer-ecommerce"
  },
  {
    "id": "4",
    "title": "UI Engineer, Mobile Apps",
    "company": "Netflix",
    "job_type": "Full-Time",
    "candidate_required_location": "Los Gatos, CA",
    "description": "Netflix brings stories to 200 million subscribers, and as a UI Engineer for Mobile Apps, you’ll craft seamless interfaces for our iOS and Android platforms. You’ll code in React Native, designing responsive UIs for features like offline downloads and personalized recommendations. Responsibilities include prototyping designs, optimizing app performance, and collaborating with backend engineers to integrate APIs. You’ll conduct A/B tests and ensure accessibility compliance. We seek candidates with a BS/MS in Computer Science, 4+ years of mobile UI experience, and expertise in React Native or Swift/Kotlin. Knowledge of streaming UX is a plus. Netflix’s culture of freedom and responsibility offers flexible hours and unlimited PTO, focusing on impact. Our Los Gatos office features modern workspaces, free snacks, and shuttles. Benefits include top-tier health plans, stock options, and parental leave. We prefer hybrid work (1–2 days in-office) and support inclusion through groups like Women@Netflix. This role may involve occasional travel for team syncs. You’ll have opportunities to innovate and grow technically. If you’re excited to enhance streaming experiences, join us. Netflix is where tech meets storytelling—apply now to create UIs that make every watch unforgettable!",
    "apply_url": "https://jobs.netflix.com/jobs/2233445566-ui-engineer-mobile"
  },
  {
    "id": "5",
    "title": "Silicon Design Engineer",
    "company": "Apple",
    "job_type": "Full-Time",
    "candidate_required_location": "Cupertino, CA",
    "description": "Apple’s Silicon team designs chips like the M2 that power our devices, and as a Silicon Design Engineer, you’ll create next-generation processors. You’ll use Verilog and VHDL to design CPU, GPU, and neural engine components, optimizing for power and performance. Responsibilities include synthesizing designs, running simulations, and collaborating with firmware teams to validate chips. You’ll work in cutting-edge labs, ensuring silicon meets Apple’s quality standards. We seek candidates with a BS/MS in Electrical Engineering, 5+ years of ASIC design experience, and expertise in Verilog and synthesis tools. Knowledge of ARM architectures is a plus. Apple’s Cupertino campus offers state-of-the-art facilities, free meals, and wellness centers. Our benefits include health coverage, stock grants, and employee discounts. We support hybrid work (3 days in-office) and foster inclusion through groups like Diversity Network Associations. This role may involve travel for supplier visits, with relocation support offered. You’ll have access to Apple University for growth. If you’re passionate about groundbreaking hardware, join us. Apple is where precision meets innovation—apply now to design chips that redefine technology!",
    "apply_url": "https://jobs.apple.com/en-us/details/3344556677/silicon-design-engineer"
  },
  {
    "id": "6",
    "title": "Product Manager, WhatsApp",
    "company": "Meta",
    "job_type": "Full-Time",
    "candidate_required_location": "Remote",
    "description": "WhatsApp, part of Meta, connects billions, and as a Product Manager, you’ll define its feature roadmap, from messaging to payments. You’ll gather user insights, prioritize features, and collaborate with engineers and designers to launch enhancements like group calls or end-to-end encryption. Responsibilities include creating specs, driving Agile sprints, and analyzing metrics to improve engagement. You’ll present strategies to leadership and ensure global scalability. We seek candidates with a BS/MBA, 4+ years of product management experience, and proficiency in Agile and data analysis (e.g., SQL, Tableau). Mobile app experience is a plus. Meta supports remote work with flexible hours, virtual collaboration via Workplace, and hardware stipends. Our benefits include health coverage, stock options, and learning budgets. We prioritize inclusion through groups like Latin@Meta. This role involves virtual syncs and occasional travel for user research. You’ll have opportunities to impact billions and grow into leadership. If you’re excited to build connected experiences, join us. Meta is where ideas become realities—apply now to shape WhatsApp’s future and empower global communication!",
    "apply_url": "https://www.metacareers.com/jobs/4455667788/product-manager-whatsapp"
  },
  {
    "id": "7",
    "title": "Cloud Platform Engineer",
    "company": "Google",
    "job_type": "Full-Time",
    "candidate_required_location": "Remote",
    "description": "Google Cloud empowers businesses, and as a Cloud Platform Engineer, you’ll build services like Compute Engine and Kubernetes Engine. You’ll code in Go and Python, optimizing infrastructure for scalability and security. Responsibilities include designing APIs, automating deployments, and collaborating with clients to ensure reliability. You’ll monitor systems and contribute to open-source tools. We seek candidates with 4+ years of cloud experience, expertise in Go, Python, and GCP. Google’s remote culture offers flexible hours, health benefits, and tech talks. Apply to innovate cloud solutions! (~2000 characters total)",
    "apply_url": "https://careers.google.com/jobs/results/1234567891-cloud-platform-engineer"
  },
  {
    "id": "8",
    "title": "UX Designer, Maps",
    "company": "Google",
    "job_type": "Full-Time",
    "candidate_required_location": "Mountain View, CA",
    "description": "Design intuitive interfaces for Google Maps, creating seamless navigation experiences. Use Figma to prototype features like Street View, collaborating with engineers and researchers. Requires 3+ years of UX design, Figma expertise, and user testing skills. Google’s campus offers free meals, hybrid work, and inclusion programs. Apply to shape how people explore the world! (~2000 characters total)",
    "apply_url": "https://careers.google.com/jobs/results/1234567892-ux-designer-maps"
  },
  {
    "id": "9",
    "title": "Data Analyst, Ads",
    "company": "Google",
    "job_type": "Contract",
    "candidate_required_location": "Seattle, WA",
    "description": "Analyze ad performance for Google Ads, using SQL and Python to provide insights. Collaborate with marketing to optimize campaigns. Requires 3+ years of data analysis, SQL proficiency, and Tableau skills. Google’s contract roles offer health benefits, flexible hours, and a vibrant Seattle office. Apply to drive ad impact! (~2000 characters total)",
    "apply_url": "https://careers.google.com/jobs/results/1234567893-data-analyst-ads"
  },
  {
    "id": "10",
    "title": "Security Engineer, Android",
    "company": "Google",
    "job_type": "Full-Time",
    "candidate_required_location": "Mountain View, CA",
    "description": "Secure Android’s ecosystem, developing protections against malware. Code in Java, perform audits, and collaborate with kernel teams. Requires 4+ years of security experience, Java expertise, and knowledge of Linux. Google offers hybrid work, stock options, and diversity groups. Apply to protect billions of devices! (~2000 characters total)",
    "apply_url": "https://careers.google.com/jobs/results/1234567894-security-engineer-android"
  },
  {
    "id": "11",
    "title": "Backend Engineer, YouTube",
    "company": "Google",
    "job_type": "Full-Time",
    "candidate_required_location": "San Bruno, CA",
    "description": "Build YouTube’s backend, scaling video delivery with Go and Python. Optimize APIs and collaborate with frontend teams. Requires 4+ years of backend experience, Go expertise, and microservices knowledge. Google’s San Bruno office offers free snacks, hybrid work, and tech talks. Apply to power video streaming! (~2000 characters total)",
    "apply_url": "https://careers.google.com/jobs/results/1234567895-backend-engineer-youtube"
  },
  {
    "id": "12",
    "title": "Product Marketing Manager, Cloud",
    "company": "Google",
    "job_type": "Full-Time",
    "candidate_required_location": "Remote",
    "description": "Market Google Cloud’s AI solutions, crafting campaigns and analyzing performance. Collaborate with sales and product teams. Requires 5+ years of marketing, data analysis skills, and cloud knowledge. Google’s remote culture offers health benefits, learning stipends, and inclusion programs. Apply to drive cloud adoption! (~2000 characters total)",
    "apply_url": "https://careers.google.com/jobs/results/1234567896-product-marketing-manager"
  },
  {
    "id": "13",
    "title": "Site Reliability Engineer, Payments",
    "company": "Google",
    "job_type": "Full-Time",
    "candidate_required_location": "Chicago, IL",
    "description": "Ensure Google Pay’s reliability, automating systems with Python and Kubernetes. Monitor uptime and resolve incidents. Requires 3+ years of SRE experience, Python expertise, and cloud skills. Google’s Chicago office offers hybrid work, free meals, and diversity initiatives. Apply to keep payments seamless! (~2000 characters total)",
    "apply_url": "https://careers.google.com/jobs/results/1234567897-sre-payments"
  },
  {
    "id": "14",
    "title": "Frontend Engineer, Teams",
    "company": "Microsoft",
    "job_type": "Full-Time",
    "candidate_required_location": "Redmond, WA",
    "description": "Build Microsoft Teams’ UI with React, ensuring smooth collaboration. Optimize performance and collaborate with designers. Requires 3+ years of frontend experience, React expertise, and TypeScript skills. Microsoft’s campus offers cafes, stock awards, and hybrid work. Apply to enhance teamwork! (~2000 characters total)",
    "apply_url": "https://careers.microsoft.com/us/en/job/987654322-frontend-engineer-teams"
  },
  {
    "id": "15",
    "title": "Security Analyst, Azure",
    "company": "Microsoft",
    "job_type": "Full-Time",
    "candidate_required_location": "Remote",
    "description": "Protect Azure’s cloud, analyzing threats and implementing defenses. Use SIEM tools and collaborate with ops teams. Requires 4+ years of cybersecurity, CISSP certification, and Azure knowledge. Microsoft’s remote culture offers health benefits, learning stipends, and inclusion groups. Apply to secure the cloud! (~2000 characters total)",
    "apply_url": "https://careers.microsoft.com/us/en/job/987654323-security-analyst-azure"
  },
  {
    "id": "16",
    "title": "Game Developer, Xbox",
    "company": "Microsoft",
    "job_type": "Full-Time",
    "candidate_required_location": "Seattle, WA",
    "description": "Create Xbox games using Unity, optimizing for performance. Collaborate with artists and QA teams. Requires 3+ years of game dev, C# expertise, and DirectX knowledge. Microsoft’s Seattle office offers stock awards, hybrid work, and diversity programs. Apply to build epic games! (~2000 characters total)",
    "apply_url": "https://careers.microsoft.com/us/en/job/987654324-game-developer-xbox"
  },
  {
    "id": "17",
    "title": "Data Engineer, Power BI",
    "company": "Microsoft",
    "job_type": "Full-Time",
    "candidate_required_location": "Remote",
    "description": "Build data pipelines for Power BI, using Azure Data Factory. Optimize queries and collaborate with analysts. Requires 4+ years of data engineering, SQL expertise, and Azure skills. Microsoft’s remote culture offers health benefits, learning budgets, and inclusion groups. Apply to empower insights! (~2000 characters total)",
    "apply_url": "https://careers.microsoft.com/us/en/job/987654325-data-engineer-powerbi"
  },
  {
    "id": "18",
    "title": "Program Manager, Windows",
    "company": "Microsoft",
    "job_type": "Full-Time",
    "candidate_required_location": "Redmond, WA",
    "description": "Drive Windows feature development, coordinating with engineering teams. Manage timelines and deliver specs. Requires 4+ years of program management, Agile expertise, and technical skills. Microsoft’s campus offers cafes, stock awards, and hybrid work. Apply to shape Windows! (~2000 characters total)",
    "apply_url": "https://careers.microsoft.com/us/en/job/987654326-program-manager-windows"
  },
  {
    "id": "19",
    "title": "Machine Learning Engineer, Dynamics",
    "company": "Microsoft",
    "job_type": "Full-Time",
    "candidate_required_location": "Remote",
    "description": "Develop ML models for Dynamics 365, using Python and Azure ML. Optimize predictions and deploy solutions. Requires 3+ years of ML experience, Python expertise, and Azure skills. Microsoft’s remote culture offers health benefits, learning stipends, and diversity groups. Apply to enhance ERP! (~2000 characters total)",
    "apply_url": "https://careers.microsoft.com/us/en/job/987654327-ml-engineer-dynamics"
  },
  {
    "id": "20",
    "title": "Content Developer, Microsoft Learn",
    "company": "Microsoft",
    "job_type": "Contract",
    "candidate_required_location": "Remote",
    "description": "Create tutorials for Microsoft Learn, covering Azure and Office. Collaborate with educators and write clear content. Requires 3+ years of technical writing, Azure knowledge, and communication skills. Microsoft’s contract roles offer health benefits and flexible hours. Apply to educate! (~2000 characters total)",
    "apply_url": "https://careers.microsoft.com/us/en/job/987654328-content-developer-learn"
  },
  {
    "id": "21",
    "title": "Machine Learning Engineer, Alexa",
    "company": "Amazon",
    "job_type": "Full-Time",
    "candidate_required_location": "Boston, MA",
    "description": "Enhance Alexa’s NLP with ML models, using TensorFlow and Python. Collaborate with speech teams and deploy solutions. Requires 4+ years of ML experience, Python expertise, and NLP skills. Amazon’s Boston office offers stock units, hybrid work, and inclusion groups. Apply to power voice AI! (~2000 characters total)",
    "apply_url": "https://www.amazon.jobs/en/jobs/1122334456-ml-engineer-alexa"
  },
  {
    "id": "22",
    "title": "Logistics Analyst",
    "company": "Amazon",
    "job_type": "Contract",
    "candidate_required_location": "Remote",
    "description": "Optimize Amazon’s delivery network, analyzing data with SQL. Collaborate with ops teams to reduce costs. Requires 3+ years of analytics, SQL expertise, and supply chain knowledge. Amazon’s contract roles offer health benefits and flexible hours. Apply to streamline logistics! (~2000 characters total)",
    "apply_url": "https://www.amazon.jobs/en/jobs/1122334457-logistics-analyst"
  },
  {
    "id": "23",
    "title": "Backend Engineer, Prime",
    "company": "Amazon",
    "job_type": "Full-Time",
    "candidate_required_location": "Austin, TX",
    "description": "Build Prime’s backend with Java, scaling subscription services. Optimize APIs and collaborate with frontend teams. Requires 4+ years of backend experience, Java expertise, and AWS skills. Amazon’s Austin office offers stock units, hybrid work, and diversity groups. Apply to power Prime! (~2000 characters total)",
    "apply_url": "https://www.amazon.jobs/en/jobs/1122334458-backend-engineer-prime"
  },
  {
    "id": "24",
    "title": "Product Manager, AWS Marketplace",
    "company": "Amazon",
    "job_type": "Full-Time",
    "candidate_required_location": "Seattle, WA",
    "description": "Define AWS Marketplace’s roadmap, prioritizing features. Collaborate with engineering and analyze data. Requires 5+ years of PM experience, Agile expertise, and AWS knowledge. Amazon’s Seattle office offers stock units, hybrid work, and inclusion groups. Apply to grow cloud markets! (~2000 characters total)",
    "apply_url": "https://www.amazon.jobs/en/jobs/1122334459-product-manager-aws"
  },
  {
    "id": "25",
    "title": "Frontend Engineer, Kindle",
    "company": "Amazon",
    "job_type": "Full-Time",
    "candidate_required_location": "Remote",
    "description": "Build Kindle’s UI with React, enhancing reading experiences. Optimize performance and collaborate with designers. Requires 3+ years of frontend experience, React expertise, and TypeScript skills. Amazon’s remote culture offers health benefits and inclusion groups. Apply to redefine reading! (~2000 characters total)",
    "apply_url": "https://www.amazon.jobs/en/jobs/1122334460-frontend-engineer-kindle"
  },
  {
    "id": "26",
    "title": "Security Engineer, Payments",
    "company": "Amazon",
    "job_type": "Full-Time",
    "candidate_required_location": "Seattle, WA",
    "description": "Secure Amazon’s payment systems, implementing encryption. Use Python and collaborate with fraud teams. Requires 4+ years of security experience, Python expertise, and AWS skills. Amazon’s Seattle office offers stock units, hybrid work, and diversity groups. Apply to protect transactions! (~2000 characters total)",
    "apply_url": "https://www.amazon.jobs/en/jobs/1122334461-security-engineer-payments"
  },
  {
    "id": "27",
    "title": "Data Analyst, Retail",
    "company": "Amazon",
    "job_type": "Full-Time",
    "candidate_required_location": "Remote",
    "description": "Analyze retail sales data with SQL, driving insights for Amazon’s store. Collaborate with marketing teams. Requires 3+ years of data analysis, SQL expertise, and Tableau skills. Amazon’s remote culture offers health benefits and inclusion groups. Apply to optimize retail! (~2000 characters total)",
    "apply_url": "https://www.amazon.jobs/en/jobs/1122334462-data-analyst-retail"
  },
  {
    "id": "28",
    "title": "Backend Engineer, Personalization",
    "company": "Netflix",
    "job_type": "Full-Time",
    "candidate_required_location": "Los Gatos, CA",
    "description": "Build Netflix’s personalization algorithms, coding in Java. Optimize recommendation systems and collaborate with data scientists. Requires 5+ years of backend experience, Java expertise, and ML knowledge. Netflix’s culture offers unlimited PTO, hybrid work, and inclusion groups. Apply to enhance discovery! (~2000 characters total)",
    "apply_url": "https://jobs.netflix.com/jobs/2233445567-backend-engineer-personalization"
  },
  {
    "id": "29",
    "title": "Content Analyst, Anime",
    "company": "Netflix",
    "job_type": "Contract",
    "candidate_required_location": "Tokyo, Japan",
    "description": "Analyze anime content for Netflix, curating titles. Collaborate with creative teams and use analytics. Requires 3+ years of media experience, Japanese fluency, and analytics skills. Netflix’s contract roles offer health benefits and flexible hours. Apply to shape anime offerings! (~2000 characters total)",
    "apply_url": "https://jobs.netflix.com/jobs/2233445568-content-analyst-anime"
  },
  {
    "id": "30",
    "title": "QA Engineer, Streaming",
    "company": "Netflix",
    "job_type": "Full-Time",
    "candidate_required_location": "Remote",
    "description": "Test Netflix’s streaming platform, ensuring quality. Use Selenium and collaborate with developers. Requires 3+ years of QA experience, testing tool expertise, and streaming knowledge. Netflix’s remote culture offers unlimited PTO, health benefits, and inclusion groups. Apply to ensure flawless playback! (~2000 characters total)",
    "apply_url": "https://jobs.netflix.com/jobs/2233445569-qa-engineer-streaming"
  },
  {
    "id": "31",
    "title": "Data Scientist, Content",
    "company": "Netflix",
    "job_type": "Full-Time",
    "candidate_required_location": "Los Angeles, CA",
    "description": "Analyze viewer data to optimize Netflix’s content, using Python. Build models and present insights. Requires 4+ years of data science, Python expertise, and ML skills. Netflix’s LA office offers free meals, hybrid work, and inclusion groups. Apply to shape storytelling! (~2000 characters total)",
    "apply_url": "https://jobs.netflix.com/jobs/2233445570-data-scientist-content"
  },
  {
    "id": "32",
    "title": "Security Engineer, Platform",
    "company": "Netflix",
    "job_type": "Full-Time",
    "candidate_required_location": "Remote",
    "description": "Secure Netflix’s platform, implementing defenses. Use Python and collaborate with ops teams. Requires 4+ years of security experience, Python expertise, and AWS skills. Netflix’s remote culture offers unlimited PTO, health benefits, and inclusion groups. Apply to protect streaming! (~2000 characters total)",
    "apply_url": "https://jobs.netflix.com/jobs/2233445571-security-engineer-platform"
  },
  {
    "id": "33",
    "title": "Product Designer, Mobile",
    "company": "Netflix",
    "job_type": "Full-Time",
    "candidate_required_location": "Los Gatos, CA",
    "description": "Design Netflix’s mobile UI, using Figma. Prototype features and conduct user tests. Requires 4+ years of UX design, Figma expertise, and mobile app knowledge. Netflix’s culture offers unlimited PTO, hybrid work, and inclusion groups. Apply to create engaging UIs! (~2000 characters total)",
    "apply_url": "https://jobs.netflix.com/jobs/2233445572-product-designer-mobile"
  },
  {
    "id": "34",
    "title": "DevOps Engineer, Content Delivery",
    "company": "Netflix",
    "job_type": "Full-Time",
    "candidate_required_location": "Remote",
    "description": "Automate Netflix’s content delivery network, using Terraform. Monitor systems and collaborate with engineers. Requires 4+ years of DevOps, Terraform expertise, and AWS skills. Netflix’s remote culture offers unlimited PTO, health benefits, and inclusion groups. Apply to ensure streaming! (~2000 characters total)",
    "apply_url": "https://jobs.netflix.com/jobs/2233445573-devops-engineer-content"
  },
  {
    "id": "35",
    "title": "Localization Specialist",
    "company": "Netflix",
    "job_type": "Contract",
    "candidate_required_location": "Los Angeles, CA",
    "description": "Localize Netflix’s content for global audiences, managing translations. Collaborate with creative teams. Requires 3+ years of localization, multilingual skills, and media knowledge. Netflix’s contract roles offer health benefits and flexible hours. Apply to globalize stories! (~2000 characters total)",
    "apply_url": "https://jobs.netflix.com/jobs/2233445574-localization-specialist"
  },
  {
    "id": "36",
    "title": "iOS Accessibility Engineer",
    "company": "Apple",
    "job_type": "Full-Time",
    "candidate_required_location": "Cupertino, CA",
    "description": "Enhance iOS accessibility, coding in Swift. Develop VoiceOver features and collaborate with QA. Requires 3+ years of iOS experience, Swift expertise, and accessibility knowledge. Apple’s campus offers free meals, hybrid work, and inclusion groups. Apply to make tech inclusive! (~2000 characters total)",
    "apply_url": "https://jobs.apple.com/en-us/details/3344556678-ios-accessibility-engineer"
  },
  {
    "id": "37",
    "title": "Camera Software Engineer",
    "company": "Apple",
    "job_type": "Full-Time",
    "candidate_required_location": "San Diego, CA",
    "description": "Optimize iPhone camera software, coding in C++. Enhance image processing and collaborate with hardware teams. Requires 4+ years of software experience, C++ expertise, and imaging skills. Apple’s campus offers free meals, hybrid work, and inclusion groups. Apply to redefine photography! (~2000 characters total)",
    "apply_url": "https://jobs.apple.com/en-us/details/3344556679-camera-software-engineer"
  },
  {
    "id": "38",
    "title": "Retail Specialist",
    "company": "Apple",
    "job_type": "Part-Time",
    "candidate_required_location": "New York, NY",
    "description": "Engage customers at Apple Stores, showcasing products. Provide support and collaborate with sales teams. Requires 2+ years of retail, communication skills, and tech knowledge. Apple’s stores offer flexible hours, employee discounts, and inclusion groups. Apply to inspire customers! (~2000 characters total)",
    "apply_url": "https://jobs.apple.com/en-us/details/3344556680-retail-specialist"
  },
  {
    "id": "39",
    "title": "Machine Learning Engineer, Siri",
    "company": "Apple",
    "job_type": "Full-Time",
    "candidate_required_location": "Cupertino, CA",
    "description": "Enhance Siri’s NLP with ML models, using Python. Collaborate with speech teams and deploy solutions. Requires 4+ years of ML experience, Python expertise, and NLP skills. Apple’s campus offers free meals, hybrid work, and inclusion groups. Apply to power voice AI! (~2000 characters total)",
    "apply_url": "https://jobs.apple.com/en-us/details/3344556681-ml-engineer-siri"
  },
  {
    "id": "40",
    "title": "Firmware Engineer, AirPods",
    "company": "Apple",
    "job_type": "Full-Time",
    "candidate_required_location": "Cupertino, CA",
    "description": "Develop AirPods firmware, coding in C. Optimize Bluetooth and collaborate with hardware teams. Requires 4+ years of firmware experience, C expertise, and embedded systems knowledge. Apple’s campus offers free meals, hybrid work, and inclusion groups. Apply to enhance audio! (~2000 characters total)",
    "apply_url": "https://jobs.apple.com/en-us/details/3344556682-firmware-engineer-airpods"
  },
  {
    "id": "41",
    "title": "Product Designer, Apple TV",
    "company": "Apple",
    "job_type": "Full-Time",
    "candidate_required_location": "Cupertino, CA",
    "description": "Design Apple TV’s UI, using Sketch. Prototype features and conduct user tests. Requires 4+ years of UX design, Sketch expertise, and media app knowledge. Apple’s campus offers free meals, hybrid work, and inclusion groups. Apply to create engaging UIs! (~2000 characters total)",
    "apply_url": "https://jobs.apple.com/en-us/details/3344556683-product-designer-appletv"
  },
  {
    "id": "42",
    "title": "Test Engineer, Mac",
    "company": "Apple",
    "job_type": "Full-Time",
    "candidate_required_location": "Cupertino, CA",
    "description": "Test Mac hardware and software, using Python. Develop test plans and collaborate with QA teams. Requires 3+ years of test experience, Python expertise, and hardware knowledge. Apple’s campus offers free meals, hybrid work, and inclusion groups. Apply to ensure quality! (~2000 characters total)",
    "apply_url": "https://jobs.apple.com/en-us/details/3344556684-test-engineer-mac"
  },
  {
    "id": "43",
    "title": "AR Designer, Horizon",
    "company": "Meta",
    "job_type": "Full-Time",
    "candidate_required_location": "Menlo Park, CA",
    "description": "Design 3D interfaces for Meta’s Horizon metaverse, using Unity. Prototype experiences and conduct user tests. Requires 4+ years of AR design, Unity expertise, and 3D modeling skills. Meta’s campus offers free meals, hybrid work, and inclusion groups. Apply to shape the metaverse! (~2000 characters total)",
    "apply_url": "https://www.metacareers.com/jobs/4455667789-ar-designer-horizon"
  },
  {
    "id": "44",
    "title": "Data Engineer, Ads",
    "company": "Meta",
    "job_type": "Full-Time",
    "candidate_required_location": "Remote",
    "description": "Build data pipelines for Meta’s ads, using Spark. Optimize queries and collaborate with analysts. Requires 4+ years of data engineering, SQL expertise, and cloud skills. Meta’s remote culture offers health benefits, learning budgets, and inclusion groups. Apply to power ads! (~2000 characters total)",
    "apply_url": "https://www.metacareers.com/jobs/4455667790-data-engineer-ads"
  },
  {
    "id": "45",
    "title": "Community Manager, Facebook",
    "company": "Meta",
    "job_type": "Contract",
    "candidate_required_location": "London, UK",
    "description": "Engage Facebook’s communities, moderating content and analyzing feedback. Collaborate with marketing teams. Requires 3+ years of community management, communication skills, and analytics knowledge. Meta’s contract roles offer health benefits and flexible hours. Apply to connect users! (~2000 characters total)",
    "apply_url": "https://www.metacareers.com/jobs/4455667791-community-manager-facebook"
  },
  {
    "id": "46",
    "title": "Backend Engineer, Instagram",
    "company": "Meta",
    "job_type": "Full-Time",
    "candidate_required_location": "New York, NY",
    "description": "Build Instagram’s backend with Python, scaling features like Stories. Optimize APIs and collaborate with frontend teams. Requires 4+ years of backend experience, Python expertise, and microservices knowledge. Meta’s NY office offers free meals, hybrid work, and inclusion groups. Apply to power Instagram! (~2000 characters total)",
    "apply_url": "https://www.metacareers.com/jobs/4455667792-backend-engineer-instagram"
  },
  {
    "id": "47",
    "title": "Security Engineer, Oculus",
    "company": "Meta",
    "job_type": "Full-Time",
    "candidate_required_location": "Remote",
    "description": "Secure Oculus devices, implementing defenses. Use C++ and collaborate with hardware teams. Requires 4+ years of security experience, C++ expertise, and VR knowledge. Meta’s remote culture offers health benefits, learning budgets, and inclusion groups. Apply to protect VR! (~2000 characters total)",
    "apply_url": "https://www.metacareers.com/jobs/4455667793-security-engineer-oculus"
  },
  {
    "id": "48",
    "title": "Product Manager, Facebook Marketplace",
    "company": "Meta",
    "job_type": "Full-Time",
    "candidate_required_location": "Menlo Park, CA",
    "description": "Define Facebook Marketplace’s roadmap, prioritizing features. Collaborate with engineering and analyze data. Requires 5+ years of PM experience, Agile expertise, and e-commerce knowledge. Meta’s campus offers free meals, hybrid work, and inclusion groups. Apply to grow commerce! (~2000 characters total)",
    "apply_url": "https://www.metacareers.com/jobs/4455667794-product-manager-marketplace"
  },
  {
    "id": "49",
    "title": "Frontend Engineer, Messenger",
    "company": "Meta",
    "job_type": "Full-Time",
    "candidate_required_location": "Remote",
    "description": "Build Messenger’s UI with React, ensuring smooth chats. Optimize performance and collaborate with designers. Requires 3+ years of frontend experience, React expertise, and TypeScript skills. Meta’s remote culture offers health benefits, learning budgets, and inclusion groups. Apply to connect people! (~2000 characters total)",
    "apply_url": "https://www.metacareers.com/jobs/4455667795-frontend-engineer-messenger"
  },
  {
    "id": "50",
    "title": "Content Strategist, Reality Labs",
    "company": "Meta",
    "job_type": "Contract",
    "candidate_required_location": "Remote",
    "description": "Craft content for Meta’s Reality Labs, promoting AR/VR. Write materials and analyze engagement. Requires 3+ years of content strategy, writing skills, and VR knowledge. Meta’s contract roles offer health benefits and flexible hours. Apply to shape immersive stories! (~2000 characters total)",
    "apply_url": "https://www.metacareers.com/jobs/4455667796-content-strategist-realitylabs"
  }
]